ORGWEBPAGE/todo.org
         -*- mode:org -*-

#+STARTUP:   align
#+TYP_TODO:  TODO IDEA WISH QUESTION DECLINED INCONSISTENCY BUG DONE
#+TAGS:      NEW(n)
#+OPTIONS:   H:2 num:t toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t
#+ARCHIVE:   ::** Archived Tasks
#+EMAIL:     carsten.dominik@gmail.com
#+TITLE:     The Org-mode TODO list

* Introduction

This is a loose collection of ideas and TODO items for the future
development of Org-mode.  These ideas come from various sources,
mostly from emacs-orgmode@gnu.org, from direct emails to me, or from
my own day-dreaming.  I don't always mention the source of an idea,
out of laziness.  However, when I implement a good idea, I try to
mention the origin of this idea in the /Acknowledgments/ section of
the manual - let me know if I forgot to give /you/ credit for
something.

** Nomenclature
   On this page, I am using TODO keywords in the following way:
   |-----------------+----------------------------------------------------|
   | *Keyword*       | Intention                                          |
   |-----------------+----------------------------------------------------|
   | *TODO*          | A development  that is going to happen, once I have time or once I figure out how to do it. |
   | *IDEA*          | A new idea, I have not yet decided what if anything I will do about it. |
   | *WISH*          | A wish, probably voiced by someone on  emacs-orgmode@gnu.org.  This is less than a new idea, more a change in existing behavior. |
   | *QUESTION*      | A question someone asked, that needs some thinking before it can be answered |
   | *DECLINED*      | I have decided not to implement this feature, but I am keeping it in the list so that people can see it, complain, or still try to convince me. |
   | *INCONSISTENCY* | Some behavior in Org-mode that is not as clean and consistent as I would like it to be. |
   | *BUG*           | This needs to be fixed, as soon as possible.       |
   | *DONE*          | Well, done is done.                                |
   | /NEW/           | This is a tag, indicating recently added entries   |
   |                 | <50>                                               |
   |-----------------+----------------------------------------------------|

   
* Tasks

** Structure
*** TODO Definition lists, like in Muse
*** TODO Get rid of all the \r instances, which were used only for XEmacs.
*** IDEA Should we allow #+TODO as an alias for #+SEQ_TODO?
*** TODO proper visibility cycling for items
    Make them not hide the text after the final list item.
    This is not trivial, we cannot usenormal outline stuff,
    needs a separate implementaiton.
*** IDEA allow different colors for different TODO keywords/tags.
*** TODO Use an indirect buffer for org-goto.
    Is there a problem with the overriding map?

*** WISH Inline TODO entries
    A way to put a TODO entry without starting a new section.

*** TODO Speedbar support for agenda.

** Agenda issues
*** QUESTION COLUMN View
    is this safe, or could things be messed up with this?
*** TODO Make S-right and S-left change TODO keywords
    Right now they change the time stamps.  This could be
    M-left/right, but this could also cause inconsistencies, because
    when on a time stamp, the same keys do exactly this.
*** WISH Make more modes changeable from the agenda
    These could be made available for toggling, just like
    follow-mode. Examples:
    - org-agenda-todo-list-sublevels
    - org-tags-match-list-sublevels
    - org-agenda-todo-ignore-scheduled
*** IDEA Sort TODO entries according to type?
    This would apply for the list collection, not in the day entries.
    However, I could also have a TODO keyword criterion that could be
    used in the day entries, as one of the minor criteria.

*** DECLINED Allow separators in the Tag-sorted agenda view
    This feature is not going to come, because block agendas can
    achieve the same thing.


** Links
*** WISH When editing links, give access to stored links.
    Not sure why this is needed.
    Idea from William Henney.
*** WISH Variable of standard links for completion with C-c C-l
    Or something like that, to make standard links fast.
*** WISH Make brackets in links possible
    Would require a display property also for the label part of
    links.
*** IDEA Find all links to a specific file
*** IDEA Make info HTML links work for links to Info files
    Info links of course only work inside Emacs.  However, many info
    documents are on the web, so the HTML exporter could try to be
    smart and convert an Info link into the corresponding link on the
    web.  For example, we could use the GNU software site then
    Name.HTML.  Here is the link to be used:
    http://www.gnu.org/software/emacs/manual/html_node/ Another
    question is, is this URL going to be stable so that it makes sense
    to actually put this into org.el?

*** IDEA Make news HTML links work, using Google.
    I can use Google groups with a message id to find a USENET message,
    even if the original link points to gnus.

*** TODO Remove irretrievable links from /published/ HTML output
    This is on David's table, and he will hopefully integrate a
    mechanism for this into org-publish.el.  The discussion about this
    was started by [[http://thread.gmane.org/gmane.emacs.orgmode/281][Austin Frank]]

*** DECLINED Agenda collections, based on #+COLLECTION lines.
    [[http://thread.gmane.org/gmane.emacs.orgmode/139][Tim Callaghan]] started the discussion on this one.
    Declined because this would depend on local variables and the
    agenda commands are global.  Also, this can actually be done by
    specifying the file list in a custom agenda command.

*** DECLINED Make CamelCase words link to corresponding org-mode files.
    Files in the same directory.  Or some other way to easy do that.
    Would be useful for publishing projects.  This would be an
    incompatible change, but I don't think anyone is using CamelCase
    anyway?
    This is marked declined, because link abbreviations now provide an
    easy way to make links to other files.

*** TODO Document the character protection in links
    I don't think this is really covered anywhere.
    Maybe we also should protect characters in the visible part, to
    make sure thing will never be on two lines...?
*** WISH Radio targets across files
    I guess each org file could write a .orgtargets.filename file, if
    it has any radio targets.


** DECLINED Fast update for external editing
   Could I use a dynamic block for this?


** Tables
*** WISH Row formulas
    @4=.....
*** TODO Write a tutorial
    Demonstrate running averages.

*** WISH Make a variable that current line should be recomputed always
   in each table, skipping headers of course.

