ORGWEBPAGE/tmp/todo.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The Org-mode TODO list</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2008/02/12 12:28:15"/>
<meta name="author" content="Carsten Dominik"/>
<link rel=stylesheet href="freeshell2.css" type="text/css">
</head><body>
<h1 class="title">The Org-mode TODO list</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<ul>
<li><a href="#sec-1">1 Introduction</a>
<ul>
<li><a href="#sec-2">1.1 Nomenclature</a></li>
</ul>
</li>
<li><a href="#sec-3">2 Tasks</a>
<ul>
<li><a href="#sec-4">2.1 Structure</a></li>
<li><a href="#sec-5">2.2 Agenda issues</a></li>
<li><a href="#sec-6">2.3 Links</a></li>
<li><a href="#sec-7">2.4 Fast update for external editing</a></li>
<li><a href="#sec-8">2.5 Tables</a></li>
<li><a href="#sec-9">2.6 Properties and Column View</a></li>
<li><a href="#sec-10">2.7 Compatibility issues</a></li>
<li><a href="#sec-11">2.8 Exporting</a></li>
<li><a href="#sec-12">2.9 Miscellaneous Stuff</a></li>
</ul>
</li>
<li><a href="#sec-13">3 Archive</a>
<ul>
<li><a href="#sec-14">3.1 Archived Tasks</a></li>
</ul>
</li>
</ul>
</div>

<div class="outline-2">
<h2 id="sec-1">1 Introduction</h2>


<p>
This is a loose collection of ideas and TODO items for the future
development of Org-mode.  These ideas come from various sources,
mostly from emacs-orgmode@gnu.org, from direct emails to me, or from
my own day-dreaming.  I don't always mention the source of an idea,
out of laziness.  However, when I implement a good idea, I try to
mention the origin of this idea in the <i>Acknowledgments</i> section of
the manual - let me know if I forgot to give <i>you</i> credit for
something.
</p>

<div class="outline-3">
<h3 id="sec-2">1.1 Nomenclature</h3>

<p>On this page, I am using TODO keywords in the following way:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<col align="left"></col><col align="left"></col>
<thead>
<tr><th><b>Keyword</b></th><th>Intention</th></tr>
</thead>
<tbody>
<tr><td><b>TODO</b></td><td>A development  that is going to happen, once I have time or once I figure out how to do it.</td></tr>
<tr><td><b>IDEA</b></td><td>A new idea, I have not yet decided what if anything I will do about it.</td></tr>
<tr><td><b>WISH</b></td><td>A wish, probably voiced by someone on  emacs-orgmode@gnu.org.  This is less than a new idea, more a change in existing behavior.</td></tr>
<tr><td><b>QUESTION</b></td><td>A question someone asked, that needs some thinking before it can be answered</td></tr>
<tr><td><b>DECLINED</b></td><td>I have decided not to implement this feature, but I am keeping it in the list so that people can see it, complain, or still try to convince me.</td></tr>
<tr><td><b>INCONSISTENCY</b></td><td>Some behavior in Org-mode that is not as clean and consistent as I would like it to be.</td></tr>
<tr><td><b>BUG</b></td><td>This needs to be fixed, as soon as possible.</td></tr>
<tr><td><b>DONE</b></td><td>Well, done is done.</td></tr>
<tr><td><i>NEW</i></td><td>This is a tag, indicating recently added entries</td></tr>
<tr><td></td><td>&lt;50&gt;</td></tr>
</tbody>
</table>



</div>
</div>

<div class="outline-2">
<h2 id="sec-3">2 Tasks</h2>



<div class="outline-3">
<h3 id="sec-4">2.1 Structure</h3>

<ul>
<li><span class="todo">TODO</span> Definition lists, like in Muse<br/>
</li>
<li><span class="todo">TODO</span> Get rid of all the \r instances, which were used only for XEmacs.<br/>
</li>
<li><span class="todo">IDEA</span> Should we allow #+TODO as an alias for #+SEQ<sub>TODO</sub>?<br/>
</li>
<li><span class="todo">TODO</span> proper visibility cycling for items<br/>
Make them not hide the text after the final list item.
This is not trivial, we cannot usenormal outline stuff,
needs a separate implementaiton.
</li>
<li><span class="todo">IDEA</span> allow different colors for different TODO keywords/tags.<br/>
</li>
<li><span class="todo">TODO</span> Use an indirect buffer for org-goto.<br/>
Is there a problem with the overriding map?

</li>
<li><span class="todo">WISH</span> Inline TODO entries<br/>
A way to put a TODO entry without starting a new section.

</li>
<li><span class="todo">TODO</span> Speedbar support for agenda.<br/>

</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-5">2.2 Agenda issues</h3>

<ul>
<li><span class="todo">QUESTION</span> COLUMN View<br/>
is this safe, or could things be messed up with this?
</li>
<li><span class="todo">TODO</span> Make S-right and S-left change TODO keywords<br/>
Right now they change the time stamps.  This could be
M-left/right, but this could also cause inconsistencies, because
when on a time stamp, the same keys do exactly this.
</li>
<li><span class="todo">WISH</span> Make more modes changeable from the agenda<br/>
These could be made available for toggling, just like
follow-mode. Examples:
<ul>
<li>
org-agenda-todo-list-sublevels
</li>
<li>
org-tags-match-list-sublevels
</li>
<li>
org-agenda-todo-ignore-scheduled
</li>
</ul></li>
<li><span class="todo">IDEA</span> Sort TODO entries according to type?<br/>
This would apply for the list collection, not in the day entries.
However, I could also have a TODO keyword criterion that could be
used in the day entries, as one of the minor criteria.

</li>
<li><span class="todo">DECLINED</span> Allow separators in the Tag-sorted agenda view<br/>
This feature is not going to come, because block agendas can
achieve the same thing.


</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-6">2.3 Links</h3>

<ul>
<li><span class="todo">WISH</span> When editing links, give access to stored links.<br/>
Not sure why this is needed.
Idea from William Henney.
</li>
<li><span class="todo">WISH</span> Variable of standard links for completion with C-c C-l<br/>
Or something like that, to make standard links fast.
</li>
<li><span class="todo">WISH</span> Make brackets in links possible<br/>
Would require a display property also for the label part of
links.
</li>
<li><span class="todo">IDEA</span> Find all links to a specific file<br/>
</li>
<li><span class="todo">IDEA</span> Make info HTML links work for links to Info files<br/>
Info links of course only work inside Emacs.  However, many info
documents are on the web, so the HTML exporter could try to be
smart and convert an Info link into the corresponding link on the
web.  For example, we could use the GNU software site then
Name.HTML.  Here is the link to be used:
<a href="http://www.gnu.org/software/emacs/manual/html_node/">http://www.gnu.org/software/emacs/manual/html_node/</a> Another
question is, is this URL going to be stable so that it makes sense
to actually put this into org.el?

</li>
<li><span class="todo">IDEA</span> Make news HTML links work, using Google.<br/>
I can use Google groups with a message id to find a USENET message,
even if the original link points to gnus.

</li>
<li><span class="todo">TODO</span> Remove irretrievable links from <i>published</i> HTML output<br/>
This is on David's table, and he will hopefully integrate a
mechanism for this into org-publish.el.  The discussion about this
was started by <a href="http://thread.gmane.org/gmane.emacs.orgmode/281">Austin Frank</a>

</li>
<li><span class="todo">DECLINED</span> Agenda collections, based on #+COLLECTION lines.<br/>
<a href="http://thread.gmane.org/gmane.emacs.orgmode/139">Tim Callaghan</a> started the discussion on this one.
Declined because this would depend on local variables and the
agenda commands are global.  Also, this can actually be done by
specifying the file list in a custom agenda command.

</li>
<li><span class="todo">DECLINED</span> Make CamelCase words link to corresponding org-mode files.<br/>
Files in the same directory.  Or some other way to easy do that.
Would be useful for publishing projects.  This would be an
incompatible change, but I don't think anyone is using CamelCase
anyway?
This is marked declined, because link abbreviations now provide an
easy way to make links to other files.

</li>
<li><span class="todo">TODO</span> Document the character protection in links<br/>
I don't think this is really covered anywhere.
Maybe we also should protect characters in the visible part, to
make sure thing will never be on two lines&hellip;?
</li>
<li><span class="todo">WISH</span> Radio targets across files<br/>
I guess each org file could write a .orgtargets.filename file, if
it has any radio targets.


</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-7">2.4 <span class="todo">DECLINED</span> Fast update for external editing</h3>

<p>Could I use a dynamic block for this?
</p>

</div>

<div class="outline-3">
<h3 id="sec-8">2.5 Tables</h3>

<ul>
<li><span class="todo">WISH</span> Row formulas<br/>
@4=&hellip;..
</li>
<li><span class="todo">TODO</span> Write a tutorial<br/>
Demonstrate running averages.

</li>
<li><span class="todo">WISH</span> Make a variable that current line should be recomputed always<br/>
in each table, skipping headers of course.

</li>
