ORGWEBPAGE/todo.org
*** TODO Allow a table to locally change the unit system
    This is for using constants.el.
    Well, it is now possible to do this for the file, is this enough???
*** QUESTION Does inserting hlines change references correctly?
*** WISH Interactive way to get a converted table?
*** BUG When computing in a narrowed column, this may go wrong.
    Computing changes fields and does not yet see correctly if the column
    width has changed, in the case of a narrowed column.

*** DECLINED Alternative for the implementation of orgtbl-minor-mode:
    I could use post-command-hook to set the variable orgtbl-mode.
    I will not do this now and only consider it if problems show up.
    
*** DECLINED Table info lines are not necessarily comments in orgtbl-mode
    Should I generalize this?  No, because the table itself will not be
    in the correct syntax for whatever mode.

*** DECLINED S-cursor motion to select part of a table, with proper highlighting.
    Similar to CUA


** Properties and Column View
*** TODO Mouse support for selecting values
    This could/should be part of org-mouse.el.
    - [ ] tags
    - [ ] todo
    - [ ] priority
    - [ ] allowed values
    - [ ] deadline
    - [ ] scheduled.
*** BUG We have no clear view on what to do with properties upon export.


** Compatibility issues
*** Emacs 21 compatibility
    This is being phased out.  Almost everything works under Emacs 21,
    but in the future I will make little effort to support it.
**** DECLINED Column view does not yet work for Emacs 21s.
     Declined, because I don't know how to do this.  Too many
     problems.
*** XEmacs compatibility
**** QUESTION Is there an issue with the coding system of HTML exported files?
     In the code I used to have a comment saying that
     :  (and (fboundp 'coding-system-get)
     :       (boundp 'buffer-file-coding-system)
     :                 buffer-file-coding-system))
     always returns nil, implicating that setting the coding system for
     the export buffer would not work correctly.  however, I have never
     followed up on this and never had a bug report - so I am wondering
     if there is an issue at all.
  
**** DECLINED Column view does not yet work for XEmacs.
     Declined, because I don't know how to do this.  Too many
     problems.
**** DECLINED Rewrite the `format' function
     To make narrowing work under XEmacs, I would need to write a
     version of /format/ that does transport text properties, or I
     would have to rework narrowing entirely.  Unlikely that this will
     happen, mainly because it is working in Emacs and so does not
     bother me personally so much.  Anyway, I don't know if people are
     actually using narrowing very much at all.


** Exporting
*** IDEA Convert links to footnotes for ASCII export.
*** DECLINED Store LaTeX code as HTML comments
    Declined because I don't really see the need for this.
*** IDEA Microformats
    Nic Ferrier has been pushing this agenda for a long time, for
    example with [[http://thread.gmane.org/gmane.emacs.orgmode/140/][this email]].  I am not deep enough into the semantic
    web that I could do this myself.  Maybe we can do this by
    modifying the html exporter step-by-step?
*** INCONSISTENCY Find a better place for formatting checkboxes
    Right now this is being done as part of `org-html-expand', which
    does not seem logically correct.
*** DECLINED Can I make the exporter more efficient?
    The line-by-line processing may not be the fastest way to do
    this.  It certainly uses more resources.  Right now the exporters
    do work though, so it is unlikely that I am going to change this.

*** DECLINED CSV import/export of tables?
    I remember this coming up several times, for example in emails
    from [[http://thread.gmane.org/gmane.emacs.orgmode/156][Niels Giesen]] and [[http://thread.gmane.org/gmane.emacs.orgmode/139][Tim Callaghan]].  Org-mode does have
    Tab-separated export of tables, so right now I don't really see
    the benefit of adding CSV export.  Are there applications that do
    not understand tab-separated files, but do understand
    comma-separated ones?

*** DECLINED In HTML export, make links from the time stamps
    Time stamps have their own class now which allows to highlight
    them etc.  But I was wondering if something more useful could be
    done with them, like a link to some kind of calendar...



** Miscellaneous Stuff
*** TODO reinstating a repeated item: keyword for logging.
*** BUG Comments cannot be filled
*** IDEA New uses for C-c C-c
    - Compute time interval on time range
    - Update CLOCK interval
*** QUESTION Fix more beginning-of-line commands
    Org-mode re-binds C-a to make this command go to the beginning of
    a visible line.  There are other keys which might invoke C-a.
    Should these keys be changed as well?  one could use
    `substitute-key-definition' on the global map to find them all.
*** QUESTION Inlining of images in Org-mode files
*** TODO Fixup outline-magic.el, so that it can be used.
*** TODO Use the new argument of bibtex-url
    Roland Winkler was kind enough to implement a new argument to the
    `bibtex-url' command that allows me to retrieve the corresponding
    URL, whether it is taken from a URL field or constructed in some
    clever way.  Currently I am not using this, because too many
    people use an old Emacs version which does not have this.
    however, eventually I will implement this.
*** WISH Get people to write articles about how to do GTD with Org-mode.
    There is now one by Charles Cave, read it [[http://members.optusnet.com.au/~charles57/GTD/orgmode.html][here]]

*** IDEA Tree statistics
    A key that can be applied to a tree, showing statistics:
    - how many headlines
    - how many TODO
    - how many DONE
    - Checkboxes
    - etc....

*** QUESTION Do we need a 43 folders implementation?
    That could easily be done in an org-mode file.  But then, maybe
    this should really be a paper thing. 

*** Priorities
    Here is some information about priorities, which is not yet
    documented.
**** QUOTE Priorities
    TODO entries: 1 or 1,2,...
    DEADLINE is 10-ddays, i.e. it is 10 on the due day
                          i.e. it goes above top todo stuff 7 days
                               before due
    SCHEDULED is 5-ddays, i.e. it is 5 on the due date
                          i.e. it goes above top todo on the due day
    TIMESTAMP is 0        i.e. always at bottom
                          but as a deadline it is 100
                          but if scheduled it is 99
    TIMERANGE is 0        i.e. always at bottom
    DIARY is 0            i.e. always at bottom

    Priority * 1000

