ORGWEBPAGE/tmp/todo.html
<li><span class="todo">TODO</span> Allow a table to locally change the unit system<br/>
This is for using constants.el.
Well, it is now possible to do this for the file, is this enough???
</li>
<li><span class="todo">QUESTION</span> Does inserting hlines change references correctly?<br/>
</li>
<li><span class="todo">WISH</span> Interactive way to get a converted table?<br/>
</li>
<li><span class="todo">BUG</span> When computing in a narrowed column, this may go wrong.<br/>
Computing changes fields and does not yet see correctly if the column
width has changed, in the case of a narrowed column.

</li>
<li><span class="todo">DECLINED</span> Alternative for the implementation of orgtbl-minor-mode:<br/>
I could use post-command-hook to set the variable orgtbl-mode.
I will not do this now and only consider it if problems show up.

</li>
<li><span class="todo">DECLINED</span> Table info lines are not necessarily comments in orgtbl-mode<br/>
Should I generalize this?  No, because the table itself will not be
in the correct syntax for whatever mode.

</li>
<li><span class="todo">DECLINED</span> S-cursor motion to select part of a table, with proper highlighting.<br/>
Similar to CUA


</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-9">2.6 Properties and Column View</h3>

<ul>
<li><span class="todo">TODO</span> Mouse support for selecting values<br/>
This could/should be part of org-mouse.el.
<ul>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> tags
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> todo
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> priority
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> allowed values
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> deadline
</li>
<li>
<b>[<span style="visibility:hidden;">X</span>]</b> scheduled.
</li>
</ul></li>
<li><span class="todo">BUG</span> We have no clear view on what to do with properties upon export.<br/>


</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-10">2.7 Compatibility issues</h3>

<ul>
<li>Emacs 21 compatibility<br/>
This is being phased out.  Almost everything works under Emacs 21,
but in the future I will make little effort to support it.
<ul>
<li><span class="todo">DECLINED</span> Column view does not yet work for Emacs 21s.<br/>
Declined, because I don't know how to do this.  Too many
problems.
</li>
</ul>
</li>
<li>XEmacs compatibility<br/>
<ul>
<li><span class="todo">QUESTION</span> Is there an issue with the coding system of HTML exported files?<br/>
In the code I used to have a comment saying that
<pre>
  (and (fboundp 'coding-system-get)
       (boundp 'buffer-file-coding-system)
                 buffer-file-coding-system))
</pre>
always returns nil, implicating that setting the coding system for
the export buffer would not work correctly.  however, I have never
followed up on this and never had a bug report - so I am wondering
if there is an issue at all.

</li>
<li><span class="todo">DECLINED</span> Column view does not yet work for XEmacs.<br/>
Declined, because I don't know how to do this.  Too many
problems.
</li>
<li><span class="todo">DECLINED</span> Rewrite the `format' function<br/>
To make narrowing work under XEmacs, I would need to write a
version of <i>format</i> that does transport text properties, or I
would have to rework narrowing entirely.  Unlikely that this will
happen, mainly because it is working in Emacs and so does not
bother me personally so much.  Anyway, I don't know if people are
actually using narrowing very much at all.


</li>
</ul>
</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-11">2.8 Exporting</h3>

<ul>
<li><span class="todo">IDEA</span> Convert links to footnotes for ASCII export.<br/>
</li>
<li><span class="todo">DECLINED</span> Store LaTeX code as HTML comments<br/>
Declined because I don't really see the need for this.
</li>
<li><span class="todo">IDEA</span> Microformats<br/>
Nic Ferrier has been pushing this agenda for a long time, for
example with <a href="http://thread.gmane.org/gmane.emacs.orgmode/140/">this email</a>.  I am not deep enough into the semantic
web that I could do this myself.  Maybe we can do this by
modifying the html exporter step-by-step?
</li>
<li><span class="todo">INCONSISTENCY</span> Find a better place for formatting checkboxes<br/>
Right now this is being done as part of `org-html-expand', which
does not seem logically correct.
</li>
<li><span class="todo">DECLINED</span> Can I make the exporter more efficient?<br/>
The line-by-line processing may not be the fastest way to do
this.  It certainly uses more resources.  Right now the exporters
do work though, so it is unlikely that I am going to change this.

</li>
<li><span class="todo">DECLINED</span> CSV import/export of tables?<br/>
I remember this coming up several times, for example in emails
from <a href="http://thread.gmane.org/gmane.emacs.orgmode/156">Niels Giesen</a> and <a href="http://thread.gmane.org/gmane.emacs.orgmode/139">Tim Callaghan</a>.  Org-mode does have
Tab-separated export of tables, so right now I don't really see
the benefit of adding CSV export.  Are there applications that do
not understand tab-separated files, but do understand
comma-separated ones?

</li>
<li><span class="todo">DECLINED</span> In HTML export, make links from the time stamps<br/>
Time stamps have their own class now which allows to highlight
them etc.  But I was wondering if something more useful could be
done with them, like a link to some kind of calendar&hellip;



</li>
</ul>
</div>

<div class="outline-3">
<h3 id="sec-12">2.9 Miscellaneous Stuff</h3>

<ul>
<li><span class="todo">TODO</span> reinstating a repeated item: keyword for logging.<br/>
</li>
<li><span class="todo">BUG</span> Comments cannot be filled<br/>
</li>
<li><span class="todo">IDEA</span> New uses for C-c C-c<br/>
<ul>
<li>
Compute time interval on time range
</li>
<li>
Update CLOCK interval
</li>
</ul></li>
<li><span class="todo">QUESTION</span> Fix more beginning-of-line commands<br/>
Org-mode re-binds C-a to make this command go to the beginning of
a visible line.  There are other keys which might invoke C-a.
Should these keys be changed as well?  one could use
`substitute-key-definition' on the global map to find them all.
</li>
<li><span class="todo">QUESTION</span> Inlining of images in Org-mode files<br/>
</li>
<li><span class="todo">TODO</span> Fixup outline-magic.el, so that it can be used.<br/>
</li>
<li><span class="todo">TODO</span> Use the new argument of bibtex-url<br/>
Roland Winkler was kind enough to implement a new argument to the
`bibtex-url' command that allows me to retrieve the corresponding
URL, whether it is taken from a URL field or constructed in some
clever way.  Currently I am not using this, because too many
people use an old Emacs version which does not have this.
however, eventually I will implement this.
</li>
<li><span class="todo">WISH</span> Get people to write articles about how to do GTD with Org-mode.<br/>
There is now one by Charles Cave, read it <a href="http://members.optusnet.com.au/~charles57/GTD/orgmode.html">here</a>

</li>
<li><span class="todo">IDEA</span> Tree statistics<br/>
A key that can be applied to a tree, showing statistics:
<ul>
<li>
how many headlines
</li>
<li>
how many TODO
</li>
<li>
how many DONE
</li>
<li>
Checkboxes
</li>
<li>
etc&hellip;.

</li>
</ul></li>
<li><span class="todo">QUESTION</span> Do we need a 43 folders implementation?<br/>
That could easily be done in an org-mode file.  But then, maybe
this should really be a paper thing. 

</li>
<li>Priorities<br/>
Here is some information about priorities, which is not yet
documented.
<ul>
<li> Priorities<br/>
<pre>    TODO entries: 1 or 1,2,...
    DEADLINE is 10-ddays, i.e. it is 10 on the due day
                          i.e. it goes above top todo stuff 7 days
                               before due
    SCHEDULED is 5-ddays, i.e. it is 5 on the due date
                          i.e. it goes above top todo on the due day
    TIMESTAMP is 0        i.e. always at bottom
                          but as a deadline it is 100
                          but if scheduled it is 99
    TIMERANGE is 0        i.e. always at bottom
    DIARY is 0            i.e. always at bottom

    Priority * 1000

</pre>
</li>
</ul>
</li>
