ORGWEBPAGE/todo.org
*** INCONSISTENCY: items don't grow/shrink due to promotion.
    In plain lists, multiple demote/promote commands executed directly
    after each other don't change the scope of the command - the
    initially selected text continues to be selected.  This is
    inconsistent with the behavior of outline sections, were the subtree
    for promotion/demotion is newly defined after each command.  Which
    convention is better?  Should this be consistent between trees and
    plain lists?

*** INCONSISTENCY: M-TAB does not work on plain lists.  Why???

*** QUESTION grep on directory does not yet work.
    I am actually not sure, I might have addressed this already, but
    my memory is failing me.  Needs some checking.

*** DECLINED HAVE a TIME 3:55 line collecting CLOCK results
    The CLOCK lines could be there in addition, or could even be
    removed, so that only one line is kept.
*** DECLINED Think about Piotr's idea of treating TODO like a TAG.
    The answer is probably NO because the simple part of TODO must
    still be there and I like the keyword at the beginning of the line,
    just like a checkbox.  Of course you can make a TODO tag yourself
    at any time.

*** DECLINED Inlining of external files

*** DECLINED Should TAB on TODO keyword rotate its state?
    Problem:  If the keyword disappears, it will suddenly start to fold....
    So my feeling right now is that the answer should be NO.

    No, because S-left/right does this already pretty well

*** DECLINED Create a DONE counter in the mode line
    That counter shows what faction of entries has been marked DONE.  I
    am not yet sure how useful such a thing would be, because of the
    huge number of entries that can be in a file, and the different
    weight of such entries.
    Declined because we do now have counters for checkboxes, and the
    feeling is that this is not so useful for TODOs.


* Archive
** Archived Tasks

*** DONE(<2006-06-01 Thu 09:15>) Commands to move through an item list
    next item, previous item.  What should happen at the boundaries of
    the current list?

*** DONE(<2006-06-01 Thu 09:16>) Force relative links, would this be useful?
    

*** DONE(<2006-06-01 Thu 09:16>) Fix empty search string.

*** DONE(<2006-06-01 Thu 09:16>) STARTUP options for logging

*** DONE(<2006-06-01 Thu 09:16>) Make a variable for Pete, to have SCHEDULED at point

*** DONE(<2006-06-01 Thu 09:16>) Fix ASCII export of narrowed columns

*** DONE(<2006-06-01 Thu 09:16>) org-file-apps should allow regular expressions

*** DONE(<2006-06-01 Thu 09:16>) fix problem with w32- versus mswindows-....

*** DONE(<2006-06-01 Thu 09:17>) Document that font-lock-mode is needed

*** DONE(<2006-06-01 Thu 09:17>) Add keyboard access and menu commands for org-project.el
    C-c C-x C-p or something like that.
    In the menu, it goes under export, or even its own group.

*** DONE(<2006-06-01 Thu 09:17>) Document those new keys in orgcard.tex
    C-c C-x C-p or something like that.
    In the menu, it goes under export, or even its own group.

*** DONE(<2006-06-01 Thu 09:17>) Remove SCHEDULED keyword when marking it done.
    in particular when adding a CLOSED timestamp.
    Only problem is that when unclosing it, it should be scheduled
    again

*** DONE(<2006-06-01 Thu 09:17>) Don't show tasks already scheduled for the future, only stuff which
    is not yet scheduled.

*** DONE(<2006-06-01 Thu 09:17>) Put title and tags in separate classes

*** DONE(<2006-06-01 Thu 09:17>) Option to leave out TAGS from export

*** DONE(<2006-06-01 Thu 09:17>) Option to leave out Timestamps from export

*** DONE(<2006-06-01 Thu 09:17>) Checkable items like Frank Ruell's proposal

*** DONE(<2006-06-01 Thu 09:17>) Classify Keywords and time stamps
    <span class="keyword">SCHEDULED: </span><span
    class="timestamp">timestamp goes here</span><br>

*** DONE(<2006-06-01 Thu 09:17>) Change default for include-all-todo to nil

*** DONE(<2006-06-01 Thu 09:17>) Specify TAGS in a special line instead of collecting them dynamically
    The could help to avoid typos and could be faster for very large files.

*** DONE(<2006-06-01 Thu 09:17>) Some much faster interface for setting tags.
    Basically, use single keys to add/remove tags from the list.  Also
    for this the idea to define tags in a special line would be good,
    in order to have a way to define the shortcuts. 

*** DONE(<2006-06-01 Thu 09:17>) Remove date stamps from headline if they are not needed.
    Bug report from Scott.


*** DONE(<2006-06-01 Thu 09:17>) : Maybe s-up/down should change priorities only in headlines
    Right now this works wherever the cursor is.  If this is changed,
    should S-up or S-down do something else?  

*** DONE(<2006-06-01 Thu 09:21>) Need a command to remove tabulators from a line.
    Use this in ASCII export, to make sure we get the indentation
    right.

*** DONE(<2006-06-01 Thu 09:24>) Improve tab in org-cycle:
    - there is a bug when the setting is 'white:  It requires a
      non-empty white line!
    - There should be another setting to have tab be the tabulator in
      the white space at the beginning of the line.
    - Finally, when TAB closes an entry, maybe it should go beck to the
      beginning of the entry???  On the other hand, it is good to be
      able to go back to the old place with just another tab.

*** DONE(<2006-06-01 Thu 11:48>) Include TAGS into sorting.
    But what strategy should be used when there are several tags?

*** DONE(<2006-06-06 Tue 10:15>) Archiving an entry in current buffer goes to end of file
    Should go to end of subtree.
    This is done now, and I also control the amount of empty lines
    created by the archiving process in general.

*** DONE(<2006-06-06 Tue 10:16>) Narrowing agenda to current files does not work as advertized.
    C-c a 1 t should make the TODO list for the current file, but does
    not.

