ORGWEBPAGE/tmp/todo.html
<li><span class="todo">INCONSISTENCY</span>: items don't grow/shrink due to promotion.<br/>
In plain lists, multiple demote/promote commands executed directly
after each other don't change the scope of the command - the
initially selected text continues to be selected.  This is
inconsistent with the behavior of outline sections, were the subtree
for promotion/demotion is newly defined after each command.  Which
convention is better?  Should this be consistent between trees and
plain lists?

</li>
<li><span class="todo">INCONSISTENCY</span>: M-TAB does not work on plain lists.  Why???<br/>

</li>
<li><span class="todo">QUESTION</span> grep on directory does not yet work.<br/>
I am actually not sure, I might have addressed this already, but
my memory is failing me.  Needs some checking.

</li>
<li><span class="todo">DECLINED</span> HAVE a TIME 3:55 line collecting CLOCK results<br/>
The CLOCK lines could be there in addition, or could even be
removed, so that only one line is kept.
</li>
<li><span class="todo">DECLINED</span> Think about Piotr's idea of treating TODO like a TAG.<br/>
The answer is probably NO because the simple part of TODO must
still be there and I like the keyword at the beginning of the line,
just like a checkbox.  Of course you can make a TODO tag yourself
at any time.

</li>
<li><span class="todo">DECLINED</span> Inlining of external files<br/>

</li>
<li><span class="todo">DECLINED</span> Should TAB on TODO keyword rotate its state?<br/>
Problem:  If the keyword disappears, it will suddenly start to fold&hellip;.
So my feeling right now is that the answer should be NO.

<p>
No, because S-left/right does this already pretty well
</p>
</li>
<li><span class="todo">DECLINED</span> Create a DONE counter in the mode line<br/>
That counter shows what faction of entries has been marked DONE.  I
am not yet sure how useful such a thing would be, because of the
huge number of entries that can be in a file, and the different
weight of such entries.
Declined because we do now have counters for checkboxes, and the
feeling is that this is not so useful for TODOs.


</li>
</ul>
</div>
</div>

<div class="outline-2">
<h2 id="sec-13">3 Archive</h2>


<div class="outline-3">
<h3 id="sec-14">3.1 Archived Tasks</h3>


<ul>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:15</span>) Commands to move through an item list<br/>
next item, previous item.  What should happen at the boundaries of
the current list?

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) Force relative links, would this be useful?<br/>


</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) Fix empty search string.<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) STARTUP options for logging<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) Make a variable for Pete, to have SCHEDULED at point<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) Fix ASCII export of narrowed columns<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) org-file-apps should allow regular expressions<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:16</span>) fix problem with w32- versus mswindows-&hellip;.<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Document that font-lock-mode is needed<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Add keyboard access and menu commands for org-project.el<br/>
C-c C-x C-p or something like that.
In the menu, it goes under export, or even its own group.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Document those new keys in orgcard.tex<br/>
C-c C-x C-p or something like that.
In the menu, it goes under export, or even its own group.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Remove SCHEDULED keyword when marking it done.<br/>
in particular when adding a CLOSED timestamp.
Only problem is that when unclosing it, it should be scheduled
again

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Don't show tasks already scheduled for the future, only stuff which<br/>
is not yet scheduled.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Put title and tags in separate classes<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Option to leave out TAGS from export<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Option to leave out Timestamps from export<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Checkable items like Frank Ruell's proposal<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Classify Keywords and time stamps<br/>
&lt;span class="keyword"&gt;SCHEDULED: &lt;/span&gt;&lt;span
class="timestamp"&gt;timestamp goes here&lt;/span&gt;&lt;br&gt;

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Change default for include-all-todo to nil<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Specify TAGS in a special line instead of collecting them dynamically<br/>
The could help to avoid typos and could be faster for very large files.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Some much faster interface for setting tags.<br/>
Basically, use single keys to add/remove tags from the list.  Also
for this the idea to define tags in a special line would be good,
in order to have a way to define the shortcuts. 

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) Remove date stamps from headline if they are not needed.<br/>
Bug report from Scott.


</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:17</span>) : Maybe s-up/down should change priorities only in headlines<br/>
Right now this works wherever the cursor is.  If this is changed,
should S-up or S-down do something else?  

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:21</span>) Need a command to remove tabulators from a line.<br/>
Use this in ASCII export, to make sure we get the indentation
right.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 09:24</span>) Improve tab in org-cycle:<br/>
<ul>
<li>
there is a bug when the setting is 'white:  It requires a
non-empty white line!
</li>
<li>
There should be another setting to have tab be the tabulator in
the white space at the beginning of the line.
</li>
<li>
Finally, when TAB closes an entry, maybe it should go beck to the
beginning of the entry???  On the other hand, it is good to be
able to go back to the old place with just another tab.

</li>
</ul></li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-01 Thu 11:48</span>) Include TAGS into sorting.<br/>
But what strategy should be used when there are several tags?

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-06 Tue 10:15</span>) Archiving an entry in current buffer goes to end of file<br/>
Should go to end of subtree.
This is done now, and I also control the amount of empty lines
created by the archiving process in general.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2006-06-06 Tue 10:16</span>) Narrowing agenda to current files does not work as advertized.<br/>
C-c a 1 t should make the TODO list for the current file, but does
not.

</li>
