ORGWEBPAGE/todo.org
*** DONE(<2006-06-06 Tue 10:17>) Radio TAGS for the fast tag interface.
    Make lists of tags that are mutually exclusive.  So when I turn on
    @HOME, @WORK would be turned off automagically.  A good syntax for
    defining these groups in the #+TAGS line would be:
    : #+TAGS: [@WORK(w) @HOME(h) @CLUB(c)] Laptop(l) PC(p) Car(r)
    This could indicate that @WORK, @HOME, @CLUB are mutually exclusive.

    If I do this, I will also need a syntax for the global alist to
    indicate the same thing.

    It seems to me that with such grouping of tags, sorting would be
    useful as it would improve the overview over the current tags.  I
    might even be able to support mutually exclusive tags with
    fontification in the interface.  Or arrange things such that the
    mutually exclusive ones are all in the same row or column, to
    optimize the visual feedback.

    For the internal format, I think best would be something like

    : '( (:startgroup) ("@work") ("@home") ("@club") (:endgroup)
    :    ("Laptop") ("PC") ("Car"))
    This setup makes sure that assoc and rassoc still do work as
    expected.

*** DONE(<2006-06-06 Tue 10:17>) Should tags be sorted in a certain way?
    Right now, you can either set the tag sequence yourself through
    the completion interface.  If you use the fast tag selection
    interface, the tag sequence depends on the order in which tags are
    selected and deselected.  maybe a specific roder would be useful
    for example the same order as the one given in the configuration?

*** DONE(<2006-06-06 Tue 10:17>) Remove narrowing cookies for export
    Exported tables should not show narrowing cookies.  In fact, if a
    table line does contain nothing but narrowing cookies, the entire
    line should be removed.

*** DONE(<2006-06-11 Sun 07:32>) Track working times similar to time-clock.el
    This was proposed by David O'Toole in an
    [[http://thread.gmane.org/gmane.emacs.orgmode/387][email to emacs-orgmode@gnu.org]].  He wants to be able to know the
    times when he worked at a particular project.  Some reporting
    possibility would be needed to make this useful.  Maybe sparse
    trees with broken-down working times?

*** DONE(<2006-06-15 Thu 13:35>) Make org-store-link do better in image-mode buffers
    Just link to the file.

*** DONE(<2006-06-15 Thu 13:35>) Use a ported version of noutline.el
    Programming the old outline-mode is really a nightmare - the new
    outline mode that uses invisibility properties instead of
    selective display works really much much better.  There is now
    an [[http://thread.gmane.org/gmane.emacs.orgmode/214/focus=218][experimental port]] by Greg Chernov, so when I find time I will
    try if this works well.  If yes, this port should become part of
    XEmacs.  Once that happens, I could remove a large amount of
    ballast from org.el

*** DONE(<2006-06-15 Thu 13:35>) Verify links during export

*** DONE(<2006-09-25 Mon 16:11>) Allow counting checkboxes
    Then some statistics should be displayed.  One idea is for
    checkboxes, to use a special box [%] which will be updated with
    percent of done.  I could have an alternative [/] that will be
    updated with something like [19/25] to show progress, and when the
    two numbers are equal, I could highlight then in DONE face, just
    like [100%].  All smaller numbers could be highlighted even in
    TODO face if I wanted.  Hmmm, I am beginning to like this.

    Then: how to update this?  Each time a checkbox is added or
    toggled, go up and update all the counts, right up to something
    which is not an item, or up to the previous header line.

    Maybe I should also make an option for turning this on, to avoid
    slowdown.  I guess for long lists this could be slow.

    Also would need a command for global update.

    An maybe plain list and checkboxes should get their own chapter?
    In Structure they seem to be a bit hidden.....

    Also a menu sublist...

*** DONE(<2006-09-25 Mon 16:11>) Allow stacking calls to org-occur
    This was a proposal from Piotr.  It is now possible, the second
    and subsequent calls to org-occur need a prefix argument to keep
    the previous highlights.

*** DONE(<2006-09-25 Mon 16:12>) Create a hook to be run after an agenda buffer has been finalized.

*** DONE(<2006-09-25 Mon 16:12>) Include TAGS into sorting.
    But what strategy should be used when there are several tags?

*** DONE(<2006-09-25 Mon 16:12>) Fixup tag display in agenda buffer.
    The tabs mess up everything.  Either remove the tabs, or realign
    the tags to some useful column.

*** DONE(<2006-09-25 Mon 16:12>) Blocks in agenda:
    Make a single agenda buffer that contains several sets of items,
    like the TODO list, a tags list, and a day view.  Not a bad idea.
    This was [[http://thread.gmane.org/gmane.emacs.orgmode/167/focus=168][Piotr's idea]].

*** DONE(<2006-09-25 Mon 16:12>) Make org-store-link do the right thing in dired-mode

*** DONE([2006-11-02 Thu 10:24]) Control over windows being used for agenda and related buffers :NEW:

*** DONE([2007-01-24 Wed 12:59]) Extend access to table fields
    Find a general way to get any rectangular region into a calc
    vector

*** DONE([2007-01-24 Wed 12:59]) Allow links to remote images to be inlined.

*** DONE([2007-01-24 Wed 12:59]) M-TAB on an already complete tag should add the ":"

*** DONE([2007-01-24 Wed 13:07]) Need a command to do show hierarchy after isearch.
    Maybe automatically, using isearch-mode-end-hook.  But this does
    not seem to work, because to is called before the overlays are
    re-installed.  I can create a new hook, isearch-exit-hook, run in
    `isearch-exit'.

*** DONE([2007-02-18 Sun 07:16]) hook for users to do their own agenda lists
    New function dumping headline into the agenda buffer, based on regexp
    and callback, to allow general stuff.  For the special tags, we can
    search for one and check for the others using the callback.

*** DONE([2007-02-18 Sun 07:37]) Make C-c C-l also work on a plain link, converting it into bracket.

*** DONE([2007-02-18 Sun 07:37]) GNUS gnus:mail.general#123 stuff should be "Email from:..."

*** DONE([2007-02-18 Sun 07:38]) Email/message context:  What format?
    I can think of two good formats for this:
    : Email from John Smith   (if I an the receiver)
    : Email to John Smith     (if I am the author)
    or
    : John Smith on: Some subject     (this is the current Org-mode default.)
    The first format requires better parsing of the messages (to get
    both author and receiver names), and also
    some way to detect if I am the author of this email or not.

*** DONE([2007-02-21 Wed 12:04]) Allow internal links to match inside *other* link
    Only the link itself that actually triggered the search.

