ORGWEBPAGE/todo.org
*** DONE([2007-02-21 Wed 12:07]) Allow fully protected HTML code that will be exported as is
    Currently, @<...> works only for simple tags, and I think we
    should have something better.  Idea:  Text between <protecthtml>
    and </protecthtml>, mark it with a text property and then exclude
    each match in the run preparing the export.
    I guess I could require these at the beginning of the line, like

#+PROTECT

#+ENDPROECT

    or something like that.......

*** DONE([2007-03-13 Tue 05:19]) Make it possible to set TOC levels independently of headline levels
    The easiest way to do this would obviously be to allow a number
    setting for the tco switch, not only a simple t/nil switch.  This
    can be nice for webpages:  One could have only top-level or level
    1 and 2 in the toc at the beginning of the page, and then still a
    more complex structure below.

*** DONE([2007-03-13 Tue 05:20]) Filling is not done in a compatible way.
    The current setup used the Emacs variables and machine to get the
    filling of plain lists and everything lese right.  XEmacs uses the
    filladapt package, which has different ways to do the same
    things.  org.el should be smart about this and setup filling under
    XEmacs correctly.

*** DONE([2007-06-06 Wed 17:44]) Repeating Schedules?
    [[http://thread.gmane.org/gmane.emacs.orgmode/149][Dieter Grollman]] requested this feature, but for now I have decided
    not to do anything about it.  I don't see a good way to implement
    this, and I believe that cyclic diary entries are good enough for
    such tasks.

*** DONE([2007-06-14 Thu 13:16]) improve item indentation when promoting and demoting

*** DONE([2007-06-14 Thu 13:17]) The TODO buffer lists possible TODO keywords
    These are taken from the current buffer, so when multiple buffers
    are involved, this list may not be correct.....

*** DONE([2007-06-14 Thu 13:20]) Conflict between bold emphasis and headlines
    At the beginning of a line, Org-mode does not know if *bold* is a
    headline or an emphasis.  This will not be easy to fix.  The way
    to do ii is to require a space after the star in headlines.  This
    requires to change outline-regexp, outline-level, the many many
    times when outline regexp is used in the program, and also the
    countless times when I am simply matching th stars directly.

*** DONE C-c - for cycling bullet types.
    ARCHIVED: <2007-07-02 Mon>

*** DONE improve what TAB does with new item
    ARCHIVED: <2007-07-02 Mon>
    same or additional indentation????

*** DONE Make it easier to do monthly agendas, and agendas for ranges
    ARCHIVED: <2007-07-02 Mon>

*** DONE Introduce a LOCATION keyword
    ARCHIVED: <2007-07-02 Mon>
    similar to DEADLINE and SCHEDULED
    Idea from Bastien
    This could be done now using properties, I don't think we need a
    special thing for this anymore.

*** DONE Times/date not always removed in agenda lines
    ARCHIVED: <2007-07-02 Mon>
    Even when org-agenda-remove-times-when-in-prefix is set, there
    seem to be cases where this does not work.  I forgot what the
    example was - does anyone remember?

*** DONE Links are still highlighted in fixed-width environments.
    ARCHIVED: <2007-07-02 Mon>
    This ties in with the problem that there is no way to have
    protected HTML code in the file.

* COMMENT HTML style specifications

# Local Variables: 
# org-export-html-style: "<link rel=stylesheet href=\"freeshell2.css\" type=\"text/css\"> <style type=\"text/css\"> .tag { color: red; font-weight:bold}</style>" 
# End:
