ORGWEBPAGE/tmp/todo.html
<li><span class="done">DONE</span>( <span class="timestamp">2007-02-21 Wed 12:07</span>) Allow fully protected HTML code that will be exported as is<br/>
Currently, <&hellip;> works only for simple tags, and I think we
should have something better.  Idea:  Text between &lt;protecthtml&gt;
and &lt;/protecthtml&gt;, mark it with a text property and then exclude
each match in the run preparing the export.
I guess I could require these at the beginning of the line, like



<p>
or something like that&hellip;&hellip;.
</p>
</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-03-13 Tue 05:19</span>) Make it possible to set TOC levels independently of headline levels<br/>
The easiest way to do this would obviously be to allow a number
setting for the tco switch, not only a simple t/nil switch.  This
can be nice for webpages:  One could have only top-level or level
1 and 2 in the toc at the beginning of the page, and then still a
more complex structure below.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-03-13 Tue 05:20</span>) Filling is not done in a compatible way.<br/>
The current setup used the Emacs variables and machine to get the
filling of plain lists and everything lese right.  XEmacs uses the
filladapt package, which has different ways to do the same
things.  org.el should be smart about this and setup filling under
XEmacs correctly.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-06-06 Wed 17:44</span>) Repeating Schedules?<br/>
<a href="http://thread.gmane.org/gmane.emacs.orgmode/149">Dieter Grollman</a> requested this feature, but for now I have decided
not to do anything about it.  I don't see a good way to implement
this, and I believe that cyclic diary entries are good enough for
such tasks.

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-06-14 Thu 13:16</span>) improve item indentation when promoting and demoting<br/>

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-06-14 Thu 13:17</span>) The TODO buffer lists possible TODO keywords<br/>
These are taken from the current buffer, so when multiple buffers
are involved, this list may not be correct&hellip;..

</li>
<li><span class="done">DONE</span>( <span class="timestamp">2007-06-14 Thu 13:20</span>) Conflict between bold emphasis and headlines<br/>
At the beginning of a line, Org-mode does not know if <b>bold</b> is a
headline or an emphasis.  This will not be easy to fix.  The way
to do ii is to require a space after the star in headlines.  This
requires to change outline-regexp, outline-level, the many many
times when outline regexp is used in the program, and also the
countless times when I am simply matching th stars directly.

</li>
<li><span class="done">DONE</span> C-c - for cycling bullet types.<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>

</li>
<li><span class="done">DONE</span> improve what TAB does with new item<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>
same or additional indentation????

</li>
<li><span class="done">DONE</span> Make it easier to do monthly agendas, and agendas for ranges<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>

</li>
<li><span class="done">DONE</span> Introduce a LOCATION keyword<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>
similar to DEADLINE and SCHEDULED
Idea from Bastien
This could be done now using properties, I don't think we need a
special thing for this anymore.

</li>
<li><span class="done">DONE</span> Times/date not always removed in agenda lines<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>
Even when org-agenda-remove-times-when-in-prefix is set, there
seem to be cases where this does not work.  I forgot what the
example was - does anyone remember?

</li>
<li><span class="done">DONE</span> Links are still highlighted in fixed-width environments.<br/>
ARCHIVED: <span class="timestamp">2007-07-02 Mon</span>
This ties in with the problem that there is no way to have
protected HTML code in the file.


</li>
</ul>
</div>
</div>
<div id="postamble"><p class="author"> Author: Carsten Dominik
<a href="mailto:carsten.dominik@gmail.com">&lt;carsten.dominik@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2008/02/12 12:28:15</p>
</div></body>
</html>
